// Задача 2
// Console.Write("Введите первое число: ");
// int num1  = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int num2  = Convert.ToInt32(Console.ReadLine());
// if (num1 > num2) {
    // Console.Write("Максимальное число " + num1);
// }
// else {
    // Console.Write("Максимальное число " + num2);
// }

// Задача 4
// Console.Write("Введите первое число: ");
// int a  = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int b  = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите третье число: ");
// int c  = Convert.ToInt32(Console.ReadLine());
// if (a > b & a > c) {
    // Console.Write("Максимальное число " + a);
// }
// if (b > a & b > c) {
    // Console.Write("Максимальное число " + b);
// }
// if (c > a & c > b) {
    // Console.Write("Максимальное число " + c);
// }

// Задача 6
Console.Write("Введите число: ");
int value  = Convert.ToInt32(Console.ReadLine());
if ((value % 2) == 0) {
    Console.Write("Данное число явяляется четным");
}
else{
    Console.Write("Данное число не является четным");
}



